from my_modules.chess_module_01 import main


''' Задание_2
📌Добавьте в пакет, созданный на семинаре шахматный модуль. 
📌Внутри него напишите код, решающий задачу о 8 ферзях. 
📌Известно, что на доске 8x8 можно расставить 8 ферзей так, чтобы они не били друг друга. 
📌Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга. 
📌Программа получает на вход восемь пар чисел, каждое число от 1 до 8 - координаты 8 ферзей. 
📌Если ферзи не бьют друг друга верните истину, а если бьют - ложь.
'''


if __name__ == "__main__":
    main()
